In [17]:
dataframe2=pd.DataFrame(dataset)

In [19]:
dataframe2.set_index(['ID','date'])

Empty DataFrame
Columns: []
Index: [(1, 2010-03-08), (2, 2018-09-07)]

# Below is the demonstration of loc and iloc

In [34]:
dataframe3=pd.read_csv(r"C:\Users\manpr\OneDrive\Desktop\Python\dataset9_joining on index\movie_dataset2.csv",
                parse_dates=['release date', 'formal release date'])

In [35]:
dataframe3

,MID,Rank,Category,Status,Release_ID,release date,formal release date
0,101,1,A,Released,NaN,2010-03-08,2010-03-08
1,102,2,A,Not Released,NaN,2020-03-08,2020-03-08
2,103,3,A,Not Released,103.0,2021-12-28,2021-12-28
3,110,10,A,Not Released,104.0,2018-11-27,2018-11-27
4,111,11,B,Not Released,105.0,2017-10-09,2017-10-09
5,112,13,B,Released,106.0,2005-01-01,2005-01-01
6,113,15,C,Released,NaN,2002-03-06,2002-03-06
7,114,16,C,Released,NaN,2001-06-02,2001-06-02
8,115,18,C,Released,NaN,2008-07-03,2008-07-03

In [36]:
dataframe3.dtypes

MID                             int64
Rank                            int64
Category                       object
Status                         object
Release_ID                    float64
release date           datetime64[ns]
formal release date    datetime64[ns]
dtype: object

In [57]:
dataset={'ID':[1,2,3,4],'Amount':[200,300,400,500],'Quantity':[8000,9000,10000,11000]}

In [59]:
dataframe2=pd.DataFrame(dataset)

In [60]:
dataframe2

   ID  Amount  Quantity
0   1     200      8000
1   2     300      9000
2   3     400     10000
3   4     500     11000

In [61]:
dataframe2.set_index('ID')

    Amount  Quantity
ID
1      200      8000
2      300      9000
3      400     10000
4      500     11000

In [49]:
dataframe1.loc[0,'Amount']

200

In [50]:
dataframe1.loc[0:3,'ID':'Amount']

   ID  Amount
0   1     200
1   2     300
2   3     400
3   4     500

In [53]:
dataframe1.loc[0:3,'Amount']

0    200
1    300
2    400
3    500
Name: Amount, dtype: int64

In [63]:
dataframe2.loc[0:3,'Amount':'Quantity']

   Amount  Quantity
0     200      8000
1     300      9000
2     400     10000
3     500     11000

In [64]:
dataframe2.loc[0:3,'ID':'Quantity']

   ID  Amount  Quantity
0   1     200      8000
1   2     300      9000
2   3     400     10000
3   4     500     11000

In [65]:
dataframe2.loc[0:3,'ID':'Amount']

   ID  Amount
0   1     200
1   2     300
2   3     400
3   4     500

In [69]:
dataframe2.loc[0:3,'ID':'Amount']

   ID  Amount
0   1     200
1   2     300
2   3     400
3   4     500

In [70]:
dataframe2.loc[0:2,:]
#It displays all columns

   ID  Amount  Quantity
0   1     200      8000
1   2     300      9000
2   3     400     10000

In [72]:
dataframe2.loc[[1,2,3],:]

   ID  Amount  Quantity
1   2     300      9000
2   3     400     10000
3   4     500     11000

In [74]:
dataframe2.loc[[1,2,3],['Quantity','Amount']]

   Quantity  Amount
1      9000     300
2     10000     400
3     11000     500

In [76]:
dataframe2.loc[:,:]

   ID  Amount  Quantity
0   1     200      8000
1   2     300      9000
2   3     400     10000
3   4     500     11000

In [77]:
dataframe2.loc[dataframe2['Amount']==200]

   ID  Amount  Quantity
0   1     200      8000

In [78]:
dataframe2[dataframe2['Amount']==200]

   ID  Amount  Quantity
0   1     200      8000

In [84]:
dataframe2.loc[dataframe2['Amount']==200,['ID','Quantity']]

   ID  Quantity
0   1      8000

In [87]:
dataframe2.iloc[:,0:3]

   ID  Amount  Quantity
0   1     200      8000
1   2     300      9000
2   3     400     10000
3   4     500     11000

In [88]:
dataframe2.iloc[:,0:2]

   ID  Amount
0   1     200
1   2     300
2   3     400
3   4     500

In [89]:
#In loc both values are inclusive whereas in iloc only one value is inclusive.